package nettyUDP;

import java.util.Random;

/**
* @author andychen https://blog.51cto.com/14815984
* @description：系统常量
*/
public class Constant {
   /**
    * 广播地址
    */
   public static final String BROADCAST_IP = "255.255.255.255";
   /**
    * 接收者端口(固定的)
    */
   public static final int ACCEPTER_PORT = 8700;
   /**
    * 通知池
    */
   private static final String[] NOTICE_POOL = {
           "多国疫情突然反弹，北京下一步怎么办？",
           "端午假期，这位政法委书记去了边境",
           "省委书记、省长们的端午假期",
           "人社部回应图书馆留言大叔 送吴桂春们求职就业指南",
           "北京通报病例情况，有句话出现十多次",
           "北京26日新增病例活动轨迹公布！涉及这些地方！\n",
           "蚊蝇增多是否会传播新冠病毒？官方回应来了",
           "俄罗斯将扩大直接对华供应食品地区名单",
           "一图看懂：新发地到底有多大多复杂？",
           "倒闭、亏损、坏账，影视行业如何“活下去”？",
           "警察献血反被辱！香港医管局：致歉并展开调查",
           "华为获准在英国建研发中心 美官员“打招呼”过问",
           "105所高校通过认证！教育部公布一份重磅名单",
           "北京新增确诊17例：北京16天确诊297例",
           "印度陆军司令:已在中印实控线做长期准备",
           "印度增兵边境做出两冒险动作 中方须做冲突升级准备",
           "中印对峙印度下一步会有何行动？偷袭奇袭捞一把就走",
           "印度大批军机飞向拉达克想洗刷耻辱 直升机紧急着陆",
           "蓬佩奥为何反对伊朗买歼10？将威胁美在波斯湾秩序",
           "美国防授权法呼吁美军医疗船安慰号及仁慈号停靠台湾",
           "印度造舰能力有多强？媒体：像当年的中日韩值得看好",
           "中国6代战机究竟长啥样:机头尖锐无平尾",
           "歼16电子战机有多强：干扰距离翻倍 优于美军EA-18G",
           "我军PCL09车载炮为何上高原 高低搭配火力覆盖没死角",
           "胡锡进：这时候谁愿意去美国？签证留给黄之锋吧",
           "美方因涉港问题对中方官员实施签证限制 中方回应",
           "我军为何选择6-25高炮放弃单35 根本原因并不在火炮",
           "在中国问题上 短视的是莫迪买单的是印度",
           "解放军驻吉布提基地官兵已换装星空迷彩服",
           "印度陆军司令向防长汇报：在中印实控线做长期准备",
           "印度多架军机在中印边境密集活动 直升机紧急着陆",
           "我军PCL09车载炮为何上高原 高低搭配火力覆盖没死角",
           "蓬佩奥为何反对伊朗买歼10？将威胁美在波斯湾秩序",
           "美国防授权法呼吁美军医疗船安慰号及仁慈号停靠台湾"
   };
   /**
    * 获取消息
    */
   public static String getNotice(){
       Random r = new Random();
       return NOTICE_POOL[r.nextInt(NOTICE_POOL.length)];
   }
}